###################################################################

# Created by write_sdc on Wed Sep 24 09:18:49 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance 1.000000e+04kOhm -capacitance 1.000000e-04pF    \
-voltage V -current uA
set_wire_load_mode top
set_max_area 0
set_load -pin_load 0.5 [get_ports {x_old[31]}]
set_load -pin_load 0.5 [get_ports {x_old[30]}]
set_load -pin_load 0.5 [get_ports {x_old[29]}]
set_load -pin_load 0.5 [get_ports {x_old[28]}]
set_load -pin_load 0.5 [get_ports {x_old[27]}]
set_load -pin_load 0.5 [get_ports {x_old[26]}]
set_load -pin_load 0.5 [get_ports {x_old[25]}]
set_load -pin_load 0.5 [get_ports {x_old[24]}]
set_load -pin_load 0.5 [get_ports {x_old[23]}]
set_load -pin_load 0.5 [get_ports {x_old[22]}]
set_load -pin_load 0.5 [get_ports {x_old[21]}]
set_load -pin_load 0.5 [get_ports {x_old[20]}]
set_load -pin_load 0.5 [get_ports {x_old[19]}]
set_load -pin_load 0.5 [get_ports {x_old[18]}]
set_load -pin_load 0.5 [get_ports {x_old[17]}]
set_load -pin_load 0.5 [get_ports {x_old[16]}]
set_load -pin_load 0.5 [get_ports {x_old[15]}]
set_load -pin_load 0.5 [get_ports {x_old[14]}]
set_load -pin_load 0.5 [get_ports {x_old[13]}]
set_load -pin_load 0.5 [get_ports {x_old[12]}]
set_load -pin_load 0.5 [get_ports {x_old[11]}]
set_load -pin_load 0.5 [get_ports {x_old[10]}]
set_load -pin_load 0.5 [get_ports {x_old[9]}]
set_load -pin_load 0.5 [get_ports {x_old[8]}]
set_load -pin_load 0.5 [get_ports {x_old[7]}]
set_load -pin_load 0.5 [get_ports {x_old[6]}]
set_load -pin_load 0.5 [get_ports {x_old[5]}]
set_load -pin_load 0.5 [get_ports {x_old[4]}]
set_load -pin_load 0.5 [get_ports {x_old[3]}]
set_load -pin_load 0.5 [get_ports {x_old[2]}]
set_load -pin_load 0.5 [get_ports {x_old[1]}]
set_load -pin_load 0.5 [get_ports {x_old[0]}]
set_load -pin_load 0.5 [get_ports {w_old[31]}]
set_load -pin_load 0.5 [get_ports {w_old[30]}]
set_load -pin_load 0.5 [get_ports {w_old[29]}]
set_load -pin_load 0.5 [get_ports {w_old[28]}]
set_load -pin_load 0.5 [get_ports {w_old[27]}]
set_load -pin_load 0.5 [get_ports {w_old[26]}]
set_load -pin_load 0.5 [get_ports {w_old[25]}]
set_load -pin_load 0.5 [get_ports {w_old[24]}]
set_load -pin_load 0.5 [get_ports {w_old[23]}]
set_load -pin_load 0.5 [get_ports {w_old[22]}]
set_load -pin_load 0.5 [get_ports {w_old[21]}]
set_load -pin_load 0.5 [get_ports {w_old[20]}]
set_load -pin_load 0.5 [get_ports {w_old[19]}]
set_load -pin_load 0.5 [get_ports {w_old[18]}]
set_load -pin_load 0.5 [get_ports {w_old[17]}]
set_load -pin_load 0.5 [get_ports {w_old[16]}]
set_load -pin_load 0.5 [get_ports {w_old[15]}]
set_load -pin_load 0.5 [get_ports {w_old[14]}]
set_load -pin_load 0.5 [get_ports {w_old[13]}]
set_load -pin_load 0.5 [get_ports {w_old[12]}]
set_load -pin_load 0.5 [get_ports {w_old[11]}]
set_load -pin_load 0.5 [get_ports {w_old[10]}]
set_load -pin_load 0.5 [get_ports {w_old[9]}]
set_load -pin_load 0.5 [get_ports {w_old[8]}]
set_load -pin_load 0.5 [get_ports {w_old[7]}]
set_load -pin_load 0.5 [get_ports {w_old[6]}]
set_load -pin_load 0.5 [get_ports {w_old[5]}]
set_load -pin_load 0.5 [get_ports {w_old[4]}]
set_load -pin_load 0.5 [get_ports {w_old[3]}]
set_load -pin_load 0.5 [get_ports {w_old[2]}]
set_load -pin_load 0.5 [get_ports {w_old[1]}]
set_load -pin_load 0.5 [get_ports {w_old[0]}]
set_load -pin_load 0.5 [get_ports {pe_val[31]}]
set_load -pin_load 0.5 [get_ports {pe_val[30]}]
set_load -pin_load 0.5 [get_ports {pe_val[29]}]
set_load -pin_load 0.5 [get_ports {pe_val[28]}]
set_load -pin_load 0.5 [get_ports {pe_val[27]}]
set_load -pin_load 0.5 [get_ports {pe_val[26]}]
set_load -pin_load 0.5 [get_ports {pe_val[25]}]
set_load -pin_load 0.5 [get_ports {pe_val[24]}]
set_load -pin_load 0.5 [get_ports {pe_val[23]}]
set_load -pin_load 0.5 [get_ports {pe_val[22]}]
set_load -pin_load 0.5 [get_ports {pe_val[21]}]
set_load -pin_load 0.5 [get_ports {pe_val[20]}]
set_load -pin_load 0.5 [get_ports {pe_val[19]}]
set_load -pin_load 0.5 [get_ports {pe_val[18]}]
set_load -pin_load 0.5 [get_ports {pe_val[17]}]
set_load -pin_load 0.5 [get_ports {pe_val[16]}]
set_load -pin_load 0.5 [get_ports {pe_val[15]}]
set_load -pin_load 0.5 [get_ports {pe_val[14]}]
set_load -pin_load 0.5 [get_ports {pe_val[13]}]
set_load -pin_load 0.5 [get_ports {pe_val[12]}]
set_load -pin_load 0.5 [get_ports {pe_val[11]}]
set_load -pin_load 0.5 [get_ports {pe_val[10]}]
set_load -pin_load 0.5 [get_ports {pe_val[9]}]
set_load -pin_load 0.5 [get_ports {pe_val[8]}]
set_load -pin_load 0.5 [get_ports {pe_val[7]}]
set_load -pin_load 0.5 [get_ports {pe_val[6]}]
set_load -pin_load 0.5 [get_ports {pe_val[5]}]
set_load -pin_load 0.5 [get_ports {pe_val[4]}]
set_load -pin_load 0.5 [get_ports {pe_val[3]}]
set_load -pin_load 0.5 [get_ports {pe_val[2]}]
set_load -pin_load 0.5 [get_ports {pe_val[1]}]
set_load -pin_load 0.5 [get_ports {pe_val[0]}]
set_max_capacitance 100 [get_ports {x_old[31]}]
set_max_capacitance 100 [get_ports {x_old[30]}]
set_max_capacitance 100 [get_ports {x_old[29]}]
set_max_capacitance 100 [get_ports {x_old[28]}]
set_max_capacitance 100 [get_ports {x_old[27]}]
set_max_capacitance 100 [get_ports {x_old[26]}]
set_max_capacitance 100 [get_ports {x_old[25]}]
set_max_capacitance 100 [get_ports {x_old[24]}]
set_max_capacitance 100 [get_ports {x_old[23]}]
set_max_capacitance 100 [get_ports {x_old[22]}]
set_max_capacitance 100 [get_ports {x_old[21]}]
set_max_capacitance 100 [get_ports {x_old[20]}]
set_max_capacitance 100 [get_ports {x_old[19]}]
set_max_capacitance 100 [get_ports {x_old[18]}]
set_max_capacitance 100 [get_ports {x_old[17]}]
set_max_capacitance 100 [get_ports {x_old[16]}]
set_max_capacitance 100 [get_ports {x_old[15]}]
set_max_capacitance 100 [get_ports {x_old[14]}]
set_max_capacitance 100 [get_ports {x_old[13]}]
set_max_capacitance 100 [get_ports {x_old[12]}]
set_max_capacitance 100 [get_ports {x_old[11]}]
set_max_capacitance 100 [get_ports {x_old[10]}]
set_max_capacitance 100 [get_ports {x_old[9]}]
set_max_capacitance 100 [get_ports {x_old[8]}]
set_max_capacitance 100 [get_ports {x_old[7]}]
set_max_capacitance 100 [get_ports {x_old[6]}]
set_max_capacitance 100 [get_ports {x_old[5]}]
set_max_capacitance 100 [get_ports {x_old[4]}]
set_max_capacitance 100 [get_ports {x_old[3]}]
set_max_capacitance 100 [get_ports {x_old[2]}]
set_max_capacitance 100 [get_ports {x_old[1]}]
set_max_capacitance 100 [get_ports {x_old[0]}]
set_max_capacitance 100 [get_ports {w_old[31]}]
set_max_capacitance 100 [get_ports {w_old[30]}]
set_max_capacitance 100 [get_ports {w_old[29]}]
set_max_capacitance 100 [get_ports {w_old[28]}]
set_max_capacitance 100 [get_ports {w_old[27]}]
set_max_capacitance 100 [get_ports {w_old[26]}]
set_max_capacitance 100 [get_ports {w_old[25]}]
set_max_capacitance 100 [get_ports {w_old[24]}]
set_max_capacitance 100 [get_ports {w_old[23]}]
set_max_capacitance 100 [get_ports {w_old[22]}]
set_max_capacitance 100 [get_ports {w_old[21]}]
set_max_capacitance 100 [get_ports {w_old[20]}]
set_max_capacitance 100 [get_ports {w_old[19]}]
set_max_capacitance 100 [get_ports {w_old[18]}]
set_max_capacitance 100 [get_ports {w_old[17]}]
set_max_capacitance 100 [get_ports {w_old[16]}]
set_max_capacitance 100 [get_ports {w_old[15]}]
set_max_capacitance 100 [get_ports {w_old[14]}]
set_max_capacitance 100 [get_ports {w_old[13]}]
set_max_capacitance 100 [get_ports {w_old[12]}]
set_max_capacitance 100 [get_ports {w_old[11]}]
set_max_capacitance 100 [get_ports {w_old[10]}]
set_max_capacitance 100 [get_ports {w_old[9]}]
set_max_capacitance 100 [get_ports {w_old[8]}]
set_max_capacitance 100 [get_ports {w_old[7]}]
set_max_capacitance 100 [get_ports {w_old[6]}]
set_max_capacitance 100 [get_ports {w_old[5]}]
set_max_capacitance 100 [get_ports {w_old[4]}]
set_max_capacitance 100 [get_ports {w_old[3]}]
set_max_capacitance 100 [get_ports {w_old[2]}]
set_max_capacitance 100 [get_ports {w_old[1]}]
set_max_capacitance 100 [get_ports {w_old[0]}]
set_max_capacitance 100 [get_ports {pe_val[31]}]
set_max_capacitance 100 [get_ports {pe_val[30]}]
set_max_capacitance 100 [get_ports {pe_val[29]}]
set_max_capacitance 100 [get_ports {pe_val[28]}]
set_max_capacitance 100 [get_ports {pe_val[27]}]
set_max_capacitance 100 [get_ports {pe_val[26]}]
set_max_capacitance 100 [get_ports {pe_val[25]}]
set_max_capacitance 100 [get_ports {pe_val[24]}]
set_max_capacitance 100 [get_ports {pe_val[23]}]
set_max_capacitance 100 [get_ports {pe_val[22]}]
set_max_capacitance 100 [get_ports {pe_val[21]}]
set_max_capacitance 100 [get_ports {pe_val[20]}]
set_max_capacitance 100 [get_ports {pe_val[19]}]
set_max_capacitance 100 [get_ports {pe_val[18]}]
set_max_capacitance 100 [get_ports {pe_val[17]}]
set_max_capacitance 100 [get_ports {pe_val[16]}]
set_max_capacitance 100 [get_ports {pe_val[15]}]
set_max_capacitance 100 [get_ports {pe_val[14]}]
set_max_capacitance 100 [get_ports {pe_val[13]}]
set_max_capacitance 100 [get_ports {pe_val[12]}]
set_max_capacitance 100 [get_ports {pe_val[11]}]
set_max_capacitance 100 [get_ports {pe_val[10]}]
set_max_capacitance 100 [get_ports {pe_val[9]}]
set_max_capacitance 100 [get_ports {pe_val[8]}]
set_max_capacitance 100 [get_ports {pe_val[7]}]
set_max_capacitance 100 [get_ports {pe_val[6]}]
set_max_capacitance 100 [get_ports {pe_val[5]}]
set_max_capacitance 100 [get_ports {pe_val[4]}]
set_max_capacitance 100 [get_ports {pe_val[3]}]
set_max_capacitance 100 [get_ports {pe_val[2]}]
set_max_capacitance 100 [get_ports {pe_val[1]}]
set_max_capacitance 100 [get_ports {pe_val[0]}]
set_max_fanout 4 [get_ports rst]
set_max_fanout 4 [get_ports {x_new[31]}]
set_max_fanout 4 [get_ports {x_new[30]}]
set_max_fanout 4 [get_ports {x_new[29]}]
set_max_fanout 4 [get_ports {x_new[28]}]
set_max_fanout 4 [get_ports {x_new[27]}]
set_max_fanout 4 [get_ports {x_new[26]}]
set_max_fanout 4 [get_ports {x_new[25]}]
set_max_fanout 4 [get_ports {x_new[24]}]
set_max_fanout 4 [get_ports {x_new[23]}]
set_max_fanout 4 [get_ports {x_new[22]}]
set_max_fanout 4 [get_ports {x_new[21]}]
set_max_fanout 4 [get_ports {x_new[20]}]
set_max_fanout 4 [get_ports {x_new[19]}]
set_max_fanout 4 [get_ports {x_new[18]}]
set_max_fanout 4 [get_ports {x_new[17]}]
set_max_fanout 4 [get_ports {x_new[16]}]
set_max_fanout 4 [get_ports {x_new[15]}]
set_max_fanout 4 [get_ports {x_new[14]}]
set_max_fanout 4 [get_ports {x_new[13]}]
set_max_fanout 4 [get_ports {x_new[12]}]
set_max_fanout 4 [get_ports {x_new[11]}]
set_max_fanout 4 [get_ports {x_new[10]}]
set_max_fanout 4 [get_ports {x_new[9]}]
set_max_fanout 4 [get_ports {x_new[8]}]
set_max_fanout 4 [get_ports {x_new[7]}]
set_max_fanout 4 [get_ports {x_new[6]}]
set_max_fanout 4 [get_ports {x_new[5]}]
set_max_fanout 4 [get_ports {x_new[4]}]
set_max_fanout 4 [get_ports {x_new[3]}]
set_max_fanout 4 [get_ports {x_new[2]}]
set_max_fanout 4 [get_ports {x_new[1]}]
set_max_fanout 4 [get_ports {x_new[0]}]
set_max_fanout 4 [get_ports {w_new[31]}]
set_max_fanout 4 [get_ports {w_new[30]}]
set_max_fanout 4 [get_ports {w_new[29]}]
set_max_fanout 4 [get_ports {w_new[28]}]
set_max_fanout 4 [get_ports {w_new[27]}]
set_max_fanout 4 [get_ports {w_new[26]}]
set_max_fanout 4 [get_ports {w_new[25]}]
set_max_fanout 4 [get_ports {w_new[24]}]
set_max_fanout 4 [get_ports {w_new[23]}]
set_max_fanout 4 [get_ports {w_new[22]}]
set_max_fanout 4 [get_ports {w_new[21]}]
set_max_fanout 4 [get_ports {w_new[20]}]
set_max_fanout 4 [get_ports {w_new[19]}]
set_max_fanout 4 [get_ports {w_new[18]}]
set_max_fanout 4 [get_ports {w_new[17]}]
set_max_fanout 4 [get_ports {w_new[16]}]
set_max_fanout 4 [get_ports {w_new[15]}]
set_max_fanout 4 [get_ports {w_new[14]}]
set_max_fanout 4 [get_ports {w_new[13]}]
set_max_fanout 4 [get_ports {w_new[12]}]
set_max_fanout 4 [get_ports {w_new[11]}]
set_max_fanout 4 [get_ports {w_new[10]}]
set_max_fanout 4 [get_ports {w_new[9]}]
set_max_fanout 4 [get_ports {w_new[8]}]
set_max_fanout 4 [get_ports {w_new[7]}]
set_max_fanout 4 [get_ports {w_new[6]}]
set_max_fanout 4 [get_ports {w_new[5]}]
set_max_fanout 4 [get_ports {w_new[4]}]
set_max_fanout 4 [get_ports {w_new[3]}]
set_max_fanout 4 [get_ports {w_new[2]}]
set_max_fanout 4 [get_ports {w_new[1]}]
set_max_fanout 4 [get_ports {w_new[0]}]
set_max_transition 10 [get_ports rst]
set_max_transition 10 [get_ports {x_new[31]}]
set_max_transition 10 [get_ports {x_new[30]}]
set_max_transition 10 [get_ports {x_new[29]}]
set_max_transition 10 [get_ports {x_new[28]}]
set_max_transition 10 [get_ports {x_new[27]}]
set_max_transition 10 [get_ports {x_new[26]}]
set_max_transition 10 [get_ports {x_new[25]}]
set_max_transition 10 [get_ports {x_new[24]}]
set_max_transition 10 [get_ports {x_new[23]}]
set_max_transition 10 [get_ports {x_new[22]}]
set_max_transition 10 [get_ports {x_new[21]}]
set_max_transition 10 [get_ports {x_new[20]}]
set_max_transition 10 [get_ports {x_new[19]}]
set_max_transition 10 [get_ports {x_new[18]}]
set_max_transition 10 [get_ports {x_new[17]}]
set_max_transition 10 [get_ports {x_new[16]}]
set_max_transition 10 [get_ports {x_new[15]}]
set_max_transition 10 [get_ports {x_new[14]}]
set_max_transition 10 [get_ports {x_new[13]}]
set_max_transition 10 [get_ports {x_new[12]}]
set_max_transition 10 [get_ports {x_new[11]}]
set_max_transition 10 [get_ports {x_new[10]}]
set_max_transition 10 [get_ports {x_new[9]}]
set_max_transition 10 [get_ports {x_new[8]}]
set_max_transition 10 [get_ports {x_new[7]}]
set_max_transition 10 [get_ports {x_new[6]}]
set_max_transition 10 [get_ports {x_new[5]}]
set_max_transition 10 [get_ports {x_new[4]}]
set_max_transition 10 [get_ports {x_new[3]}]
set_max_transition 10 [get_ports {x_new[2]}]
set_max_transition 10 [get_ports {x_new[1]}]
set_max_transition 10 [get_ports {x_new[0]}]
set_max_transition 10 [get_ports {w_new[31]}]
set_max_transition 10 [get_ports {w_new[30]}]
set_max_transition 10 [get_ports {w_new[29]}]
set_max_transition 10 [get_ports {w_new[28]}]
set_max_transition 10 [get_ports {w_new[27]}]
set_max_transition 10 [get_ports {w_new[26]}]
set_max_transition 10 [get_ports {w_new[25]}]
set_max_transition 10 [get_ports {w_new[24]}]
set_max_transition 10 [get_ports {w_new[23]}]
set_max_transition 10 [get_ports {w_new[22]}]
set_max_transition 10 [get_ports {w_new[21]}]
set_max_transition 10 [get_ports {w_new[20]}]
set_max_transition 10 [get_ports {w_new[19]}]
set_max_transition 10 [get_ports {w_new[18]}]
set_max_transition 10 [get_ports {w_new[17]}]
set_max_transition 10 [get_ports {w_new[16]}]
set_max_transition 10 [get_ports {w_new[15]}]
set_max_transition 10 [get_ports {w_new[14]}]
set_max_transition 10 [get_ports {w_new[13]}]
set_max_transition 10 [get_ports {w_new[12]}]
set_max_transition 10 [get_ports {w_new[11]}]
set_max_transition 10 [get_ports {w_new[10]}]
set_max_transition 10 [get_ports {w_new[9]}]
set_max_transition 10 [get_ports {w_new[8]}]
set_max_transition 10 [get_ports {w_new[7]}]
set_max_transition 10 [get_ports {w_new[6]}]
set_max_transition 10 [get_ports {w_new[5]}]
set_max_transition 10 [get_ports {w_new[4]}]
set_max_transition 10 [get_ports {w_new[3]}]
set_max_transition 10 [get_ports {w_new[2]}]
set_max_transition 10 [get_ports {w_new[1]}]
set_max_transition 10 [get_ports {w_new[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -name MAIN_CLOCK  -period 2  -waveform {0 1}
set_clock_latency -max 0.1  [get_clocks MAIN_CLOCK]
set_clock_latency -source -max 0.4  [get_clocks MAIN_CLOCK]
set_clock_uncertainty -setup 0.3  [get_clocks MAIN_CLOCK]
set_clock_transition -min -fall 0.2 [get_clocks MAIN_CLOCK]
set_clock_transition -min -rise 0.2 [get_clocks MAIN_CLOCK]
set_clock_transition -max -fall 0.2 [get_clocks MAIN_CLOCK]
set_clock_transition -max -rise 0.2 [get_clocks MAIN_CLOCK]
group_path -weight 5  -name COMBO  -from [list [get_ports clk] [get_ports rst] [get_ports {x_new[31]}]           \
[get_ports {x_new[30]}] [get_ports {x_new[29]}] [get_ports {x_new[28]}]        \
[get_ports {x_new[27]}] [get_ports {x_new[26]}] [get_ports {x_new[25]}]        \
[get_ports {x_new[24]}] [get_ports {x_new[23]}] [get_ports {x_new[22]}]        \
[get_ports {x_new[21]}] [get_ports {x_new[20]}] [get_ports {x_new[19]}]        \
[get_ports {x_new[18]}] [get_ports {x_new[17]}] [get_ports {x_new[16]}]        \
[get_ports {x_new[15]}] [get_ports {x_new[14]}] [get_ports {x_new[13]}]        \
[get_ports {x_new[12]}] [get_ports {x_new[11]}] [get_ports {x_new[10]}]        \
[get_ports {x_new[9]}] [get_ports {x_new[8]}] [get_ports {x_new[7]}]           \
[get_ports {x_new[6]}] [get_ports {x_new[5]}] [get_ports {x_new[4]}]           \
[get_ports {x_new[3]}] [get_ports {x_new[2]}] [get_ports {x_new[1]}]           \
[get_ports {x_new[0]}] [get_ports {w_new[31]}] [get_ports {w_new[30]}]         \
[get_ports {w_new[29]}] [get_ports {w_new[28]}] [get_ports {w_new[27]}]        \
[get_ports {w_new[26]}] [get_ports {w_new[25]}] [get_ports {w_new[24]}]        \
[get_ports {w_new[23]}] [get_ports {w_new[22]}] [get_ports {w_new[21]}]        \
[get_ports {w_new[20]}] [get_ports {w_new[19]}] [get_ports {w_new[18]}]        \
[get_ports {w_new[17]}] [get_ports {w_new[16]}] [get_ports {w_new[15]}]        \
[get_ports {w_new[14]}] [get_ports {w_new[13]}] [get_ports {w_new[12]}]        \
[get_ports {w_new[11]}] [get_ports {w_new[10]}] [get_ports {w_new[9]}]         \
[get_ports {w_new[8]}] [get_ports {w_new[7]}] [get_ports {w_new[6]}]           \
[get_ports {w_new[5]}] [get_ports {w_new[4]}] [get_ports {w_new[3]}]           \
[get_ports {w_new[2]}] [get_ports {w_new[1]}] [get_ports {w_new[0]}]]  -to [list [get_ports {x_old[31]}] [get_ports {x_old[30]}] [get_ports          \
{x_old[29]}] [get_ports {x_old[28]}] [get_ports {x_old[27]}] [get_ports        \
{x_old[26]}] [get_ports {x_old[25]}] [get_ports {x_old[24]}] [get_ports        \
{x_old[23]}] [get_ports {x_old[22]}] [get_ports {x_old[21]}] [get_ports        \
{x_old[20]}] [get_ports {x_old[19]}] [get_ports {x_old[18]}] [get_ports        \
{x_old[17]}] [get_ports {x_old[16]}] [get_ports {x_old[15]}] [get_ports        \
{x_old[14]}] [get_ports {x_old[13]}] [get_ports {x_old[12]}] [get_ports        \
{x_old[11]}] [get_ports {x_old[10]}] [get_ports {x_old[9]}] [get_ports         \
{x_old[8]}] [get_ports {x_old[7]}] [get_ports {x_old[6]}] [get_ports           \
{x_old[5]}] [get_ports {x_old[4]}] [get_ports {x_old[3]}] [get_ports           \
{x_old[2]}] [get_ports {x_old[1]}] [get_ports {x_old[0]}] [get_ports           \
{w_old[31]}] [get_ports {w_old[30]}] [get_ports {w_old[29]}] [get_ports        \
{w_old[28]}] [get_ports {w_old[27]}] [get_ports {w_old[26]}] [get_ports        \
{w_old[25]}] [get_ports {w_old[24]}] [get_ports {w_old[23]}] [get_ports        \
{w_old[22]}] [get_ports {w_old[21]}] [get_ports {w_old[20]}] [get_ports        \
{w_old[19]}] [get_ports {w_old[18]}] [get_ports {w_old[17]}] [get_ports        \
{w_old[16]}] [get_ports {w_old[15]}] [get_ports {w_old[14]}] [get_ports        \
{w_old[13]}] [get_ports {w_old[12]}] [get_ports {w_old[11]}] [get_ports        \
{w_old[10]}] [get_ports {w_old[9]}] [get_ports {w_old[8]}] [get_ports          \
{w_old[7]}] [get_ports {w_old[6]}] [get_ports {w_old[5]}] [get_ports           \
{w_old[4]}] [get_ports {w_old[3]}] [get_ports {w_old[2]}] [get_ports           \
{w_old[1]}] [get_ports {w_old[0]}] [get_ports {pe_val[31]}] [get_ports         \
{pe_val[30]}] [get_ports {pe_val[29]}] [get_ports {pe_val[28]}] [get_ports     \
{pe_val[27]}] [get_ports {pe_val[26]}] [get_ports {pe_val[25]}] [get_ports     \
{pe_val[24]}] [get_ports {pe_val[23]}] [get_ports {pe_val[22]}] [get_ports     \
{pe_val[21]}] [get_ports {pe_val[20]}] [get_ports {pe_val[19]}] [get_ports     \
{pe_val[18]}] [get_ports {pe_val[17]}] [get_ports {pe_val[16]}] [get_ports     \
{pe_val[15]}] [get_ports {pe_val[14]}] [get_ports {pe_val[13]}] [get_ports     \
{pe_val[12]}] [get_ports {pe_val[11]}] [get_ports {pe_val[10]}] [get_ports     \
{pe_val[9]}] [get_ports {pe_val[8]}] [get_ports {pe_val[7]}] [get_ports        \
{pe_val[6]}] [get_ports {pe_val[5]}] [get_ports {pe_val[4]}] [get_ports        \
{pe_val[3]}] [get_ports {pe_val[2]}] [get_ports {pe_val[1]}] [get_ports        \
{pe_val[0]}]]
group_path -weight 5  -name MAIN_CLOCK  -to [get_clocks MAIN_CLOCK]
group_path -name INPUTS  -from [list [get_ports clk] [get_ports rst] [get_ports {x_new[31]}]           \
[get_ports {x_new[30]}] [get_ports {x_new[29]}] [get_ports {x_new[28]}]        \
[get_ports {x_new[27]}] [get_ports {x_new[26]}] [get_ports {x_new[25]}]        \
[get_ports {x_new[24]}] [get_ports {x_new[23]}] [get_ports {x_new[22]}]        \
[get_ports {x_new[21]}] [get_ports {x_new[20]}] [get_ports {x_new[19]}]        \
[get_ports {x_new[18]}] [get_ports {x_new[17]}] [get_ports {x_new[16]}]        \
[get_ports {x_new[15]}] [get_ports {x_new[14]}] [get_ports {x_new[13]}]        \
[get_ports {x_new[12]}] [get_ports {x_new[11]}] [get_ports {x_new[10]}]        \
[get_ports {x_new[9]}] [get_ports {x_new[8]}] [get_ports {x_new[7]}]           \
[get_ports {x_new[6]}] [get_ports {x_new[5]}] [get_ports {x_new[4]}]           \
[get_ports {x_new[3]}] [get_ports {x_new[2]}] [get_ports {x_new[1]}]           \
[get_ports {x_new[0]}] [get_ports {w_new[31]}] [get_ports {w_new[30]}]         \
[get_ports {w_new[29]}] [get_ports {w_new[28]}] [get_ports {w_new[27]}]        \
[get_ports {w_new[26]}] [get_ports {w_new[25]}] [get_ports {w_new[24]}]        \
[get_ports {w_new[23]}] [get_ports {w_new[22]}] [get_ports {w_new[21]}]        \
[get_ports {w_new[20]}] [get_ports {w_new[19]}] [get_ports {w_new[18]}]        \
[get_ports {w_new[17]}] [get_ports {w_new[16]}] [get_ports {w_new[15]}]        \
[get_ports {w_new[14]}] [get_ports {w_new[13]}] [get_ports {w_new[12]}]        \
[get_ports {w_new[11]}] [get_ports {w_new[10]}] [get_ports {w_new[9]}]         \
[get_ports {w_new[8]}] [get_ports {w_new[7]}] [get_ports {w_new[6]}]           \
[get_ports {w_new[5]}] [get_ports {w_new[4]}] [get_ports {w_new[3]}]           \
[get_ports {w_new[2]}] [get_ports {w_new[1]}] [get_ports {w_new[0]}]]
group_path -name OUTPUTS  -to [list [get_ports {x_old[31]}] [get_ports {x_old[30]}] [get_ports          \
{x_old[29]}] [get_ports {x_old[28]}] [get_ports {x_old[27]}] [get_ports        \
{x_old[26]}] [get_ports {x_old[25]}] [get_ports {x_old[24]}] [get_ports        \
{x_old[23]}] [get_ports {x_old[22]}] [get_ports {x_old[21]}] [get_ports        \
{x_old[20]}] [get_ports {x_old[19]}] [get_ports {x_old[18]}] [get_ports        \
{x_old[17]}] [get_ports {x_old[16]}] [get_ports {x_old[15]}] [get_ports        \
{x_old[14]}] [get_ports {x_old[13]}] [get_ports {x_old[12]}] [get_ports        \
{x_old[11]}] [get_ports {x_old[10]}] [get_ports {x_old[9]}] [get_ports         \
{x_old[8]}] [get_ports {x_old[7]}] [get_ports {x_old[6]}] [get_ports           \
{x_old[5]}] [get_ports {x_old[4]}] [get_ports {x_old[3]}] [get_ports           \
{x_old[2]}] [get_ports {x_old[1]}] [get_ports {x_old[0]}] [get_ports           \
{w_old[31]}] [get_ports {w_old[30]}] [get_ports {w_old[29]}] [get_ports        \
{w_old[28]}] [get_ports {w_old[27]}] [get_ports {w_old[26]}] [get_ports        \
{w_old[25]}] [get_ports {w_old[24]}] [get_ports {w_old[23]}] [get_ports        \
{w_old[22]}] [get_ports {w_old[21]}] [get_ports {w_old[20]}] [get_ports        \
{w_old[19]}] [get_ports {w_old[18]}] [get_ports {w_old[17]}] [get_ports        \
{w_old[16]}] [get_ports {w_old[15]}] [get_ports {w_old[14]}] [get_ports        \
{w_old[13]}] [get_ports {w_old[12]}] [get_ports {w_old[11]}] [get_ports        \
{w_old[10]}] [get_ports {w_old[9]}] [get_ports {w_old[8]}] [get_ports          \
{w_old[7]}] [get_ports {w_old[6]}] [get_ports {w_old[5]}] [get_ports           \
{w_old[4]}] [get_ports {w_old[3]}] [get_ports {w_old[2]}] [get_ports           \
{w_old[1]}] [get_ports {w_old[0]}] [get_ports {pe_val[31]}] [get_ports         \
{pe_val[30]}] [get_ports {pe_val[29]}] [get_ports {pe_val[28]}] [get_ports     \
{pe_val[27]}] [get_ports {pe_val[26]}] [get_ports {pe_val[25]}] [get_ports     \
{pe_val[24]}] [get_ports {pe_val[23]}] [get_ports {pe_val[22]}] [get_ports     \
{pe_val[21]}] [get_ports {pe_val[20]}] [get_ports {pe_val[19]}] [get_ports     \
{pe_val[18]}] [get_ports {pe_val[17]}] [get_ports {pe_val[16]}] [get_ports     \
{pe_val[15]}] [get_ports {pe_val[14]}] [get_ports {pe_val[13]}] [get_ports     \
{pe_val[12]}] [get_ports {pe_val[11]}] [get_ports {pe_val[10]}] [get_ports     \
{pe_val[9]}] [get_ports {pe_val[8]}] [get_ports {pe_val[7]}] [get_ports        \
{pe_val[6]}] [get_ports {pe_val[5]}] [get_ports {pe_val[4]}] [get_ports        \
{pe_val[3]}] [get_ports {pe_val[2]}] [get_ports {pe_val[1]}] [get_ports        \
{pe_val[0]}]]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports rst]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[31]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[30]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[29]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[28]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[27]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[26]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[25]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[24]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[23]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[22]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[21]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[20]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[19]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[18]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[17]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[16]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[15]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[14]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[13]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[12]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[11]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[10]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[9]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[8]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[7]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[6]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[5]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[4]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[3]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[2]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[1]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {x_new[0]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[31]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[30]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[29]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[28]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[27]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[26]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[25]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[24]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[23]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[22]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[21]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[20]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[19]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[18]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[17]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[16]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[15]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[14]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[13]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[12]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[11]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[10]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[9]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[8]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[7]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[6]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[5]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[4]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[3]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[2]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[1]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {w_new[0]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[31]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[30]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[29]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[28]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[27]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[26]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[25]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[24]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[23]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[22]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[21]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[20]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[19]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[18]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[17]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[16]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[15]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[14]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[13]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[12]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[11]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[10]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[9]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[8]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[7]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[6]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[5]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[4]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[3]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[2]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[1]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {x_old[0]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[31]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[30]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[29]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[28]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[27]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[26]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[25]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[24]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[23]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[22]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[21]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[20]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[19]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[18]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[17]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[16]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[15]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[14]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[13]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[12]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[11]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[10]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[9]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[8]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[7]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[6]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[5]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[4]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[3]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[2]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[1]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {w_old[0]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[31]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[30]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[29]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[28]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[27]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[26]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[25]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[24]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[23]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[22]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[21]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[20]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[19]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[18]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[17]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[16]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[15]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[14]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[13]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[12]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[11]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[10]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[9]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[8]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[7]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[6]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[5]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[4]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[3]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[2]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[1]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {pe_val[0]}]
