###################################################################

# Created by write_sdc on Sun Oct  5 07:54:02 2025

###################################################################
set sdc_version 2.1

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current uA
set_wire_load_mode top
set_max_area 0
set_load -pin_load 0.5 [get_ports {a_out[15]}]
set_load -pin_load 0.5 [get_ports {a_out[14]}]
set_load -pin_load 0.5 [get_ports {a_out[13]}]
set_load -pin_load 0.5 [get_ports {a_out[12]}]
set_load -pin_load 0.5 [get_ports {a_out[11]}]
set_load -pin_load 0.5 [get_ports {a_out[10]}]
set_load -pin_load 0.5 [get_ports {a_out[9]}]
set_load -pin_load 0.5 [get_ports {a_out[8]}]
set_load -pin_load 0.5 [get_ports {a_out[7]}]
set_load -pin_load 0.5 [get_ports {a_out[6]}]
set_load -pin_load 0.5 [get_ports {a_out[5]}]
set_load -pin_load 0.5 [get_ports {a_out[4]}]
set_load -pin_load 0.5 [get_ports {a_out[3]}]
set_load -pin_load 0.5 [get_ports {a_out[2]}]
set_load -pin_load 0.5 [get_ports {a_out[1]}]
set_load -pin_load 0.5 [get_ports {a_out[0]}]
set_load -pin_load 0.5 [get_ports {b_out[15]}]
set_load -pin_load 0.5 [get_ports {b_out[14]}]
set_load -pin_load 0.5 [get_ports {b_out[13]}]
set_load -pin_load 0.5 [get_ports {b_out[12]}]
set_load -pin_load 0.5 [get_ports {b_out[11]}]
set_load -pin_load 0.5 [get_ports {b_out[10]}]
set_load -pin_load 0.5 [get_ports {b_out[9]}]
set_load -pin_load 0.5 [get_ports {b_out[8]}]
set_load -pin_load 0.5 [get_ports {b_out[7]}]
set_load -pin_load 0.5 [get_ports {b_out[6]}]
set_load -pin_load 0.5 [get_ports {b_out[5]}]
set_load -pin_load 0.5 [get_ports {b_out[4]}]
set_load -pin_load 0.5 [get_ports {b_out[3]}]
set_load -pin_load 0.5 [get_ports {b_out[2]}]
set_load -pin_load 0.5 [get_ports {b_out[1]}]
set_load -pin_load 0.5 [get_ports {b_out[0]}]
set_load -pin_load 0.5 [get_ports {c_out[47]}]
set_load -pin_load 0.5 [get_ports {c_out[46]}]
set_load -pin_load 0.5 [get_ports {c_out[45]}]
set_load -pin_load 0.5 [get_ports {c_out[44]}]
set_load -pin_load 0.5 [get_ports {c_out[43]}]
set_load -pin_load 0.5 [get_ports {c_out[42]}]
set_load -pin_load 0.5 [get_ports {c_out[41]}]
set_load -pin_load 0.5 [get_ports {c_out[40]}]
set_load -pin_load 0.5 [get_ports {c_out[39]}]
set_load -pin_load 0.5 [get_ports {c_out[38]}]
set_load -pin_load 0.5 [get_ports {c_out[37]}]
set_load -pin_load 0.5 [get_ports {c_out[36]}]
set_load -pin_load 0.5 [get_ports {c_out[35]}]
set_load -pin_load 0.5 [get_ports {c_out[34]}]
set_load -pin_load 0.5 [get_ports {c_out[33]}]
set_load -pin_load 0.5 [get_ports {c_out[32]}]
set_load -pin_load 0.5 [get_ports {c_out[31]}]
set_load -pin_load 0.5 [get_ports {c_out[30]}]
set_load -pin_load 0.5 [get_ports {c_out[29]}]
set_load -pin_load 0.5 [get_ports {c_out[28]}]
set_load -pin_load 0.5 [get_ports {c_out[27]}]
set_load -pin_load 0.5 [get_ports {c_out[26]}]
set_load -pin_load 0.5 [get_ports {c_out[25]}]
set_load -pin_load 0.5 [get_ports {c_out[24]}]
set_load -pin_load 0.5 [get_ports {c_out[23]}]
set_load -pin_load 0.5 [get_ports {c_out[22]}]
set_load -pin_load 0.5 [get_ports {c_out[21]}]
set_load -pin_load 0.5 [get_ports {c_out[20]}]
set_load -pin_load 0.5 [get_ports {c_out[19]}]
set_load -pin_load 0.5 [get_ports {c_out[18]}]
set_load -pin_load 0.5 [get_ports {c_out[17]}]
set_load -pin_load 0.5 [get_ports {c_out[16]}]
set_load -pin_load 0.5 [get_ports {c_out[15]}]
set_load -pin_load 0.5 [get_ports {c_out[14]}]
set_load -pin_load 0.5 [get_ports {c_out[13]}]
set_load -pin_load 0.5 [get_ports {c_out[12]}]
set_load -pin_load 0.5 [get_ports {c_out[11]}]
set_load -pin_load 0.5 [get_ports {c_out[10]}]
set_load -pin_load 0.5 [get_ports {c_out[9]}]
set_load -pin_load 0.5 [get_ports {c_out[8]}]
set_load -pin_load 0.5 [get_ports {c_out[7]}]
set_load -pin_load 0.5 [get_ports {c_out[6]}]
set_load -pin_load 0.5 [get_ports {c_out[5]}]
set_load -pin_load 0.5 [get_ports {c_out[4]}]
set_load -pin_load 0.5 [get_ports {c_out[3]}]
set_load -pin_load 0.5 [get_ports {c_out[2]}]
set_load -pin_load 0.5 [get_ports {c_out[1]}]
set_load -pin_load 0.5 [get_ports {c_out[0]}]
set_max_capacitance 100 [get_ports {a_out[15]}]
set_max_capacitance 100 [get_ports {a_out[14]}]
set_max_capacitance 100 [get_ports {a_out[13]}]
set_max_capacitance 100 [get_ports {a_out[12]}]
set_max_capacitance 100 [get_ports {a_out[11]}]
set_max_capacitance 100 [get_ports {a_out[10]}]
set_max_capacitance 100 [get_ports {a_out[9]}]
set_max_capacitance 100 [get_ports {a_out[8]}]
set_max_capacitance 100 [get_ports {a_out[7]}]
set_max_capacitance 100 [get_ports {a_out[6]}]
set_max_capacitance 100 [get_ports {a_out[5]}]
set_max_capacitance 100 [get_ports {a_out[4]}]
set_max_capacitance 100 [get_ports {a_out[3]}]
set_max_capacitance 100 [get_ports {a_out[2]}]
set_max_capacitance 100 [get_ports {a_out[1]}]
set_max_capacitance 100 [get_ports {a_out[0]}]
set_max_capacitance 100 [get_ports {b_out[15]}]
set_max_capacitance 100 [get_ports {b_out[14]}]
set_max_capacitance 100 [get_ports {b_out[13]}]
set_max_capacitance 100 [get_ports {b_out[12]}]
set_max_capacitance 100 [get_ports {b_out[11]}]
set_max_capacitance 100 [get_ports {b_out[10]}]
set_max_capacitance 100 [get_ports {b_out[9]}]
set_max_capacitance 100 [get_ports {b_out[8]}]
set_max_capacitance 100 [get_ports {b_out[7]}]
set_max_capacitance 100 [get_ports {b_out[6]}]
set_max_capacitance 100 [get_ports {b_out[5]}]
set_max_capacitance 100 [get_ports {b_out[4]}]
set_max_capacitance 100 [get_ports {b_out[3]}]
set_max_capacitance 100 [get_ports {b_out[2]}]
set_max_capacitance 100 [get_ports {b_out[1]}]
set_max_capacitance 100 [get_ports {b_out[0]}]
set_max_capacitance 100 [get_ports {c_out[47]}]
set_max_capacitance 100 [get_ports {c_out[46]}]
set_max_capacitance 100 [get_ports {c_out[45]}]
set_max_capacitance 100 [get_ports {c_out[44]}]
set_max_capacitance 100 [get_ports {c_out[43]}]
set_max_capacitance 100 [get_ports {c_out[42]}]
set_max_capacitance 100 [get_ports {c_out[41]}]
set_max_capacitance 100 [get_ports {c_out[40]}]
set_max_capacitance 100 [get_ports {c_out[39]}]
set_max_capacitance 100 [get_ports {c_out[38]}]
set_max_capacitance 100 [get_ports {c_out[37]}]
set_max_capacitance 100 [get_ports {c_out[36]}]
set_max_capacitance 100 [get_ports {c_out[35]}]
set_max_capacitance 100 [get_ports {c_out[34]}]
set_max_capacitance 100 [get_ports {c_out[33]}]
set_max_capacitance 100 [get_ports {c_out[32]}]
set_max_capacitance 100 [get_ports {c_out[31]}]
set_max_capacitance 100 [get_ports {c_out[30]}]
set_max_capacitance 100 [get_ports {c_out[29]}]
set_max_capacitance 100 [get_ports {c_out[28]}]
set_max_capacitance 100 [get_ports {c_out[27]}]
set_max_capacitance 100 [get_ports {c_out[26]}]
set_max_capacitance 100 [get_ports {c_out[25]}]
set_max_capacitance 100 [get_ports {c_out[24]}]
set_max_capacitance 100 [get_ports {c_out[23]}]
set_max_capacitance 100 [get_ports {c_out[22]}]
set_max_capacitance 100 [get_ports {c_out[21]}]
set_max_capacitance 100 [get_ports {c_out[20]}]
set_max_capacitance 100 [get_ports {c_out[19]}]
set_max_capacitance 100 [get_ports {c_out[18]}]
set_max_capacitance 100 [get_ports {c_out[17]}]
set_max_capacitance 100 [get_ports {c_out[16]}]
set_max_capacitance 100 [get_ports {c_out[15]}]
set_max_capacitance 100 [get_ports {c_out[14]}]
set_max_capacitance 100 [get_ports {c_out[13]}]
set_max_capacitance 100 [get_ports {c_out[12]}]
set_max_capacitance 100 [get_ports {c_out[11]}]
set_max_capacitance 100 [get_ports {c_out[10]}]
set_max_capacitance 100 [get_ports {c_out[9]}]
set_max_capacitance 100 [get_ports {c_out[8]}]
set_max_capacitance 100 [get_ports {c_out[7]}]
set_max_capacitance 100 [get_ports {c_out[6]}]
set_max_capacitance 100 [get_ports {c_out[5]}]
set_max_capacitance 100 [get_ports {c_out[4]}]
set_max_capacitance 100 [get_ports {c_out[3]}]
set_max_capacitance 100 [get_ports {c_out[2]}]
set_max_capacitance 100 [get_ports {c_out[1]}]
set_max_capacitance 100 [get_ports {c_out[0]}]
set_max_fanout 4 [get_ports rst_n]
set_max_fanout 4 [get_ports {a[15]}]
set_max_fanout 4 [get_ports {a[14]}]
set_max_fanout 4 [get_ports {a[13]}]
set_max_fanout 4 [get_ports {a[12]}]
set_max_fanout 4 [get_ports {a[11]}]
set_max_fanout 4 [get_ports {a[10]}]
set_max_fanout 4 [get_ports {a[9]}]
set_max_fanout 4 [get_ports {a[8]}]
set_max_fanout 4 [get_ports {a[7]}]
set_max_fanout 4 [get_ports {a[6]}]
set_max_fanout 4 [get_ports {a[5]}]
set_max_fanout 4 [get_ports {a[4]}]
set_max_fanout 4 [get_ports {a[3]}]
set_max_fanout 4 [get_ports {a[2]}]
set_max_fanout 4 [get_ports {a[1]}]
set_max_fanout 4 [get_ports {a[0]}]
set_max_fanout 4 [get_ports {b[15]}]
set_max_fanout 4 [get_ports {b[14]}]
set_max_fanout 4 [get_ports {b[13]}]
set_max_fanout 4 [get_ports {b[12]}]
set_max_fanout 4 [get_ports {b[11]}]
set_max_fanout 4 [get_ports {b[10]}]
set_max_fanout 4 [get_ports {b[9]}]
set_max_fanout 4 [get_ports {b[8]}]
set_max_fanout 4 [get_ports {b[7]}]
set_max_fanout 4 [get_ports {b[6]}]
set_max_fanout 4 [get_ports {b[5]}]
set_max_fanout 4 [get_ports {b[4]}]
set_max_fanout 4 [get_ports {b[3]}]
set_max_fanout 4 [get_ports {b[2]}]
set_max_fanout 4 [get_ports {b[1]}]
set_max_fanout 4 [get_ports {b[0]}]
set_max_fanout 4 [get_ports {c[47]}]
set_max_fanout 4 [get_ports {c[46]}]
set_max_fanout 4 [get_ports {c[45]}]
set_max_fanout 4 [get_ports {c[44]}]
set_max_fanout 4 [get_ports {c[43]}]
set_max_fanout 4 [get_ports {c[42]}]
set_max_fanout 4 [get_ports {c[41]}]
set_max_fanout 4 [get_ports {c[40]}]
set_max_fanout 4 [get_ports {c[39]}]
set_max_fanout 4 [get_ports {c[38]}]
set_max_fanout 4 [get_ports {c[37]}]
set_max_fanout 4 [get_ports {c[36]}]
set_max_fanout 4 [get_ports {c[35]}]
set_max_fanout 4 [get_ports {c[34]}]
set_max_fanout 4 [get_ports {c[33]}]
set_max_fanout 4 [get_ports {c[32]}]
set_max_fanout 4 [get_ports {c[31]}]
set_max_fanout 4 [get_ports {c[30]}]
set_max_fanout 4 [get_ports {c[29]}]
set_max_fanout 4 [get_ports {c[28]}]
set_max_fanout 4 [get_ports {c[27]}]
set_max_fanout 4 [get_ports {c[26]}]
set_max_fanout 4 [get_ports {c[25]}]
set_max_fanout 4 [get_ports {c[24]}]
set_max_fanout 4 [get_ports {c[23]}]
set_max_fanout 4 [get_ports {c[22]}]
set_max_fanout 4 [get_ports {c[21]}]
set_max_fanout 4 [get_ports {c[20]}]
set_max_fanout 4 [get_ports {c[19]}]
set_max_fanout 4 [get_ports {c[18]}]
set_max_fanout 4 [get_ports {c[17]}]
set_max_fanout 4 [get_ports {c[16]}]
set_max_fanout 4 [get_ports {c[15]}]
set_max_fanout 4 [get_ports {c[14]}]
set_max_fanout 4 [get_ports {c[13]}]
set_max_fanout 4 [get_ports {c[12]}]
set_max_fanout 4 [get_ports {c[11]}]
set_max_fanout 4 [get_ports {c[10]}]
set_max_fanout 4 [get_ports {c[9]}]
set_max_fanout 4 [get_ports {c[8]}]
set_max_fanout 4 [get_ports {c[7]}]
set_max_fanout 4 [get_ports {c[6]}]
set_max_fanout 4 [get_ports {c[5]}]
set_max_fanout 4 [get_ports {c[4]}]
set_max_fanout 4 [get_ports {c[3]}]
set_max_fanout 4 [get_ports {c[2]}]
set_max_fanout 4 [get_ports {c[1]}]
set_max_fanout 4 [get_ports {c[0]}]
set_max_fanout 4 [get_ports reg_clear]
set_max_fanout 4 [get_ports pipeline_en]
set_max_transition 10 [get_ports {a[15]}]
set_max_transition 10 [get_ports {a[14]}]
set_max_transition 10 [get_ports {a[13]}]
set_max_transition 10 [get_ports {a[12]}]
set_max_transition 10 [get_ports {a[11]}]
set_max_transition 10 [get_ports {a[10]}]
set_max_transition 10 [get_ports {a[9]}]
set_max_transition 10 [get_ports {a[8]}]
set_max_transition 10 [get_ports {a[7]}]
set_max_transition 10 [get_ports {a[6]}]
set_max_transition 10 [get_ports {a[5]}]
set_max_transition 10 [get_ports {a[4]}]
set_max_transition 10 [get_ports {a[3]}]
set_max_transition 10 [get_ports {a[2]}]
set_max_transition 10 [get_ports {a[1]}]
set_max_transition 10 [get_ports {a[0]}]
set_max_transition 10 [get_ports {b[15]}]
set_max_transition 10 [get_ports {b[14]}]
set_max_transition 10 [get_ports {b[13]}]
set_max_transition 10 [get_ports {b[12]}]
set_max_transition 10 [get_ports {b[11]}]
set_max_transition 10 [get_ports {b[10]}]
set_max_transition 10 [get_ports {b[9]}]
set_max_transition 10 [get_ports {b[8]}]
set_max_transition 10 [get_ports {b[7]}]
set_max_transition 10 [get_ports {b[6]}]
set_max_transition 10 [get_ports {b[5]}]
set_max_transition 10 [get_ports {b[4]}]
set_max_transition 10 [get_ports {b[3]}]
set_max_transition 10 [get_ports {b[2]}]
set_max_transition 10 [get_ports {b[1]}]
set_max_transition 10 [get_ports {b[0]}]
set_max_transition 10 [get_ports {c[47]}]
set_max_transition 10 [get_ports {c[46]}]
set_max_transition 10 [get_ports {c[45]}]
set_max_transition 10 [get_ports {c[44]}]
set_max_transition 10 [get_ports {c[43]}]
set_max_transition 10 [get_ports {c[42]}]
set_max_transition 10 [get_ports {c[41]}]
set_max_transition 10 [get_ports {c[40]}]
set_max_transition 10 [get_ports {c[39]}]
set_max_transition 10 [get_ports {c[38]}]
set_max_transition 10 [get_ports {c[37]}]
set_max_transition 10 [get_ports {c[36]}]
set_max_transition 10 [get_ports {c[35]}]
set_max_transition 10 [get_ports {c[34]}]
set_max_transition 10 [get_ports {c[33]}]
set_max_transition 10 [get_ports {c[32]}]
set_max_transition 10 [get_ports {c[31]}]
set_max_transition 10 [get_ports {c[30]}]
set_max_transition 10 [get_ports {c[29]}]
set_max_transition 10 [get_ports {c[28]}]
set_max_transition 10 [get_ports {c[27]}]
set_max_transition 10 [get_ports {c[26]}]
set_max_transition 10 [get_ports {c[25]}]
set_max_transition 10 [get_ports {c[24]}]
set_max_transition 10 [get_ports {c[23]}]
set_max_transition 10 [get_ports {c[22]}]
set_max_transition 10 [get_ports {c[21]}]
set_max_transition 10 [get_ports {c[20]}]
set_max_transition 10 [get_ports {c[19]}]
set_max_transition 10 [get_ports {c[18]}]
set_max_transition 10 [get_ports {c[17]}]
set_max_transition 10 [get_ports {c[16]}]
set_max_transition 10 [get_ports {c[15]}]
set_max_transition 10 [get_ports {c[14]}]
set_max_transition 10 [get_ports {c[13]}]
set_max_transition 10 [get_ports {c[12]}]
set_max_transition 10 [get_ports {c[11]}]
set_max_transition 10 [get_ports {c[10]}]
set_max_transition 10 [get_ports {c[9]}]
set_max_transition 10 [get_ports {c[8]}]
set_max_transition 10 [get_ports {c[7]}]
set_max_transition 10 [get_ports {c[6]}]
set_max_transition 10 [get_ports {c[5]}]
set_max_transition 10 [get_ports {c[4]}]
set_max_transition 10 [get_ports {c[3]}]
set_max_transition 10 [get_ports {c[2]}]
set_max_transition 10 [get_ports {c[1]}]
set_max_transition 10 [get_ports {c[0]}]
set_max_transition 10 [get_ports reg_clear]
set_max_transition 10 [get_ports pipeline_en]
set_ideal_network [get_ports clk]
set_ideal_network [get_ports rst_n]
create_clock [get_ports clk]  -name MAIN_CLOCK  -period 2  -waveform {0 1}
set_clock_latency -max 0.1  [get_clocks MAIN_CLOCK]
set_clock_latency -source -max 0.4  [get_clocks MAIN_CLOCK]
set_clock_uncertainty -setup 0.3  [get_clocks MAIN_CLOCK]
set_clock_transition -max -rise 0.2 [get_clocks MAIN_CLOCK]
set_clock_transition -max -fall 0.2 [get_clocks MAIN_CLOCK]
set_clock_transition -min -rise 0.2 [get_clocks MAIN_CLOCK]
set_clock_transition -min -fall 0.2 [get_clocks MAIN_CLOCK]
group_path -weight 5  -name COMBO  -from [list [get_ports clk] [get_ports rst_n] [get_ports {a[15]}] [get_ports  \
{a[14]}] [get_ports {a[13]}] [get_ports {a[12]}] [get_ports {a[11]}]           \
[get_ports {a[10]}] [get_ports {a[9]}] [get_ports {a[8]}] [get_ports {a[7]}]   \
[get_ports {a[6]}] [get_ports {a[5]}] [get_ports {a[4]}] [get_ports {a[3]}]    \
[get_ports {a[2]}] [get_ports {a[1]}] [get_ports {a[0]}] [get_ports {b[15]}]   \
[get_ports {b[14]}] [get_ports {b[13]}] [get_ports {b[12]}] [get_ports         \
{b[11]}] [get_ports {b[10]}] [get_ports {b[9]}] [get_ports {b[8]}] [get_ports  \
{b[7]}] [get_ports {b[6]}] [get_ports {b[5]}] [get_ports {b[4]}] [get_ports    \
{b[3]}] [get_ports {b[2]}] [get_ports {b[1]}] [get_ports {b[0]}] [get_ports    \
{c[47]}] [get_ports {c[46]}] [get_ports {c[45]}] [get_ports {c[44]}]           \
[get_ports {c[43]}] [get_ports {c[42]}] [get_ports {c[41]}] [get_ports         \
{c[40]}] [get_ports {c[39]}] [get_ports {c[38]}] [get_ports {c[37]}]           \
[get_ports {c[36]}] [get_ports {c[35]}] [get_ports {c[34]}] [get_ports         \
{c[33]}] [get_ports {c[32]}] [get_ports {c[31]}] [get_ports {c[30]}]           \
[get_ports {c[29]}] [get_ports {c[28]}] [get_ports {c[27]}] [get_ports         \
{c[26]}] [get_ports {c[25]}] [get_ports {c[24]}] [get_ports {c[23]}]           \
[get_ports {c[22]}] [get_ports {c[21]}] [get_ports {c[20]}] [get_ports         \
{c[19]}] [get_ports {c[18]}] [get_ports {c[17]}] [get_ports {c[16]}]           \
[get_ports {c[15]}] [get_ports {c[14]}] [get_ports {c[13]}] [get_ports         \
{c[12]}] [get_ports {c[11]}] [get_ports {c[10]}] [get_ports {c[9]}] [get_ports \
{c[8]}] [get_ports {c[7]}] [get_ports {c[6]}] [get_ports {c[5]}] [get_ports    \
{c[4]}] [get_ports {c[3]}] [get_ports {c[2]}] [get_ports {c[1]}] [get_ports    \
{c[0]}] [get_ports reg_clear] [get_ports pipeline_en]]  -to [list [get_ports {a_out[15]}] [get_ports {a_out[14]}] [get_ports          \
{a_out[13]}] [get_ports {a_out[12]}] [get_ports {a_out[11]}] [get_ports        \
{a_out[10]}] [get_ports {a_out[9]}] [get_ports {a_out[8]}] [get_ports          \
{a_out[7]}] [get_ports {a_out[6]}] [get_ports {a_out[5]}] [get_ports           \
{a_out[4]}] [get_ports {a_out[3]}] [get_ports {a_out[2]}] [get_ports           \
{a_out[1]}] [get_ports {a_out[0]}] [get_ports {b_out[15]}] [get_ports          \
{b_out[14]}] [get_ports {b_out[13]}] [get_ports {b_out[12]}] [get_ports        \
{b_out[11]}] [get_ports {b_out[10]}] [get_ports {b_out[9]}] [get_ports         \
{b_out[8]}] [get_ports {b_out[7]}] [get_ports {b_out[6]}] [get_ports           \
{b_out[5]}] [get_ports {b_out[4]}] [get_ports {b_out[3]}] [get_ports           \
{b_out[2]}] [get_ports {b_out[1]}] [get_ports {b_out[0]}] [get_ports           \
{c_out[47]}] [get_ports {c_out[46]}] [get_ports {c_out[45]}] [get_ports        \
{c_out[44]}] [get_ports {c_out[43]}] [get_ports {c_out[42]}] [get_ports        \
{c_out[41]}] [get_ports {c_out[40]}] [get_ports {c_out[39]}] [get_ports        \
{c_out[38]}] [get_ports {c_out[37]}] [get_ports {c_out[36]}] [get_ports        \
{c_out[35]}] [get_ports {c_out[34]}] [get_ports {c_out[33]}] [get_ports        \
{c_out[32]}] [get_ports {c_out[31]}] [get_ports {c_out[30]}] [get_ports        \
{c_out[29]}] [get_ports {c_out[28]}] [get_ports {c_out[27]}] [get_ports        \
{c_out[26]}] [get_ports {c_out[25]}] [get_ports {c_out[24]}] [get_ports        \
{c_out[23]}] [get_ports {c_out[22]}] [get_ports {c_out[21]}] [get_ports        \
{c_out[20]}] [get_ports {c_out[19]}] [get_ports {c_out[18]}] [get_ports        \
{c_out[17]}] [get_ports {c_out[16]}] [get_ports {c_out[15]}] [get_ports        \
{c_out[14]}] [get_ports {c_out[13]}] [get_ports {c_out[12]}] [get_ports        \
{c_out[11]}] [get_ports {c_out[10]}] [get_ports {c_out[9]}] [get_ports         \
{c_out[8]}] [get_ports {c_out[7]}] [get_ports {c_out[6]}] [get_ports           \
{c_out[5]}] [get_ports {c_out[4]}] [get_ports {c_out[3]}] [get_ports           \
{c_out[2]}] [get_ports {c_out[1]}] [get_ports {c_out[0]}]]
group_path -weight 5  -name MAIN_CLOCK  -to [get_clocks MAIN_CLOCK]
group_path -name INPUTS  -from [list [get_ports clk] [get_ports rst_n] [get_ports {a[15]}] [get_ports  \
{a[14]}] [get_ports {a[13]}] [get_ports {a[12]}] [get_ports {a[11]}]           \
[get_ports {a[10]}] [get_ports {a[9]}] [get_ports {a[8]}] [get_ports {a[7]}]   \
[get_ports {a[6]}] [get_ports {a[5]}] [get_ports {a[4]}] [get_ports {a[3]}]    \
[get_ports {a[2]}] [get_ports {a[1]}] [get_ports {a[0]}] [get_ports {b[15]}]   \
[get_ports {b[14]}] [get_ports {b[13]}] [get_ports {b[12]}] [get_ports         \
{b[11]}] [get_ports {b[10]}] [get_ports {b[9]}] [get_ports {b[8]}] [get_ports  \
{b[7]}] [get_ports {b[6]}] [get_ports {b[5]}] [get_ports {b[4]}] [get_ports    \
{b[3]}] [get_ports {b[2]}] [get_ports {b[1]}] [get_ports {b[0]}] [get_ports    \
{c[47]}] [get_ports {c[46]}] [get_ports {c[45]}] [get_ports {c[44]}]           \
[get_ports {c[43]}] [get_ports {c[42]}] [get_ports {c[41]}] [get_ports         \
{c[40]}] [get_ports {c[39]}] [get_ports {c[38]}] [get_ports {c[37]}]           \
[get_ports {c[36]}] [get_ports {c[35]}] [get_ports {c[34]}] [get_ports         \
{c[33]}] [get_ports {c[32]}] [get_ports {c[31]}] [get_ports {c[30]}]           \
[get_ports {c[29]}] [get_ports {c[28]}] [get_ports {c[27]}] [get_ports         \
{c[26]}] [get_ports {c[25]}] [get_ports {c[24]}] [get_ports {c[23]}]           \
[get_ports {c[22]}] [get_ports {c[21]}] [get_ports {c[20]}] [get_ports         \
{c[19]}] [get_ports {c[18]}] [get_ports {c[17]}] [get_ports {c[16]}]           \
[get_ports {c[15]}] [get_ports {c[14]}] [get_ports {c[13]}] [get_ports         \
{c[12]}] [get_ports {c[11]}] [get_ports {c[10]}] [get_ports {c[9]}] [get_ports \
{c[8]}] [get_ports {c[7]}] [get_ports {c[6]}] [get_ports {c[5]}] [get_ports    \
{c[4]}] [get_ports {c[3]}] [get_ports {c[2]}] [get_ports {c[1]}] [get_ports    \
{c[0]}] [get_ports reg_clear] [get_ports pipeline_en]]
group_path -name OUTPUTS  -to [list [get_ports {a_out[15]}] [get_ports {a_out[14]}] [get_ports          \
{a_out[13]}] [get_ports {a_out[12]}] [get_ports {a_out[11]}] [get_ports        \
{a_out[10]}] [get_ports {a_out[9]}] [get_ports {a_out[8]}] [get_ports          \
{a_out[7]}] [get_ports {a_out[6]}] [get_ports {a_out[5]}] [get_ports           \
{a_out[4]}] [get_ports {a_out[3]}] [get_ports {a_out[2]}] [get_ports           \
{a_out[1]}] [get_ports {a_out[0]}] [get_ports {b_out[15]}] [get_ports          \
{b_out[14]}] [get_ports {b_out[13]}] [get_ports {b_out[12]}] [get_ports        \
{b_out[11]}] [get_ports {b_out[10]}] [get_ports {b_out[9]}] [get_ports         \
{b_out[8]}] [get_ports {b_out[7]}] [get_ports {b_out[6]}] [get_ports           \
{b_out[5]}] [get_ports {b_out[4]}] [get_ports {b_out[3]}] [get_ports           \
{b_out[2]}] [get_ports {b_out[1]}] [get_ports {b_out[0]}] [get_ports           \
{c_out[47]}] [get_ports {c_out[46]}] [get_ports {c_out[45]}] [get_ports        \
{c_out[44]}] [get_ports {c_out[43]}] [get_ports {c_out[42]}] [get_ports        \
{c_out[41]}] [get_ports {c_out[40]}] [get_ports {c_out[39]}] [get_ports        \
{c_out[38]}] [get_ports {c_out[37]}] [get_ports {c_out[36]}] [get_ports        \
{c_out[35]}] [get_ports {c_out[34]}] [get_ports {c_out[33]}] [get_ports        \
{c_out[32]}] [get_ports {c_out[31]}] [get_ports {c_out[30]}] [get_ports        \
{c_out[29]}] [get_ports {c_out[28]}] [get_ports {c_out[27]}] [get_ports        \
{c_out[26]}] [get_ports {c_out[25]}] [get_ports {c_out[24]}] [get_ports        \
{c_out[23]}] [get_ports {c_out[22]}] [get_ports {c_out[21]}] [get_ports        \
{c_out[20]}] [get_ports {c_out[19]}] [get_ports {c_out[18]}] [get_ports        \
{c_out[17]}] [get_ports {c_out[16]}] [get_ports {c_out[15]}] [get_ports        \
{c_out[14]}] [get_ports {c_out[13]}] [get_ports {c_out[12]}] [get_ports        \
{c_out[11]}] [get_ports {c_out[10]}] [get_ports {c_out[9]}] [get_ports         \
{c_out[8]}] [get_ports {c_out[7]}] [get_ports {c_out[6]}] [get_ports           \
{c_out[5]}] [get_ports {c_out[4]}] [get_ports {c_out[3]}] [get_ports           \
{c_out[2]}] [get_ports {c_out[1]}] [get_ports {c_out[0]}]]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[15]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[14]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[13]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[12]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[11]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[10]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[9]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[8]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[7]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[6]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[5]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[4]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[3]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[2]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[1]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {a[0]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[15]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[14]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[13]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[12]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[11]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[10]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[9]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[8]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[7]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[6]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[5]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[4]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[3]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[2]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[1]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {b[0]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[47]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[46]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[45]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[44]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[43]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[42]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[41]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[40]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[39]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[38]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[37]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[36]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[35]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[34]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[33]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[32]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[31]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[30]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[29]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[28]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[27]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[26]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[25]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[24]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[23]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[22]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[21]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[20]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[19]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[18]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[17]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[16]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[15]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[14]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[13]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[12]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[11]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[10]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[9]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[8]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[7]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[6]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[5]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[4]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[3]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[2]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[1]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports {c[0]}]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports reg_clear]
set_input_delay -clock MAIN_CLOCK  0.1  [get_ports pipeline_en]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[15]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[14]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[13]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[12]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[11]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[10]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[9]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[8]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[7]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[6]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[5]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[4]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[3]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[2]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[1]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {a_out[0]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[15]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[14]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[13]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[12]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[11]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[10]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[9]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[8]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[7]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[6]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[5]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[4]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[3]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[2]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[1]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {b_out[0]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[47]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[46]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[45]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[44]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[43]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[42]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[41]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[40]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[39]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[38]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[37]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[36]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[35]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[34]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[33]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[32]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[31]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[30]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[29]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[28]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[27]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[26]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[25]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[24]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[23]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[22]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[21]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[20]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[19]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[18]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[17]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[16]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[15]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[14]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[13]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[12]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[11]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[10]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[9]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[8]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[7]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[6]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[5]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[4]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[3]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[2]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[1]}]
set_output_delay -clock MAIN_CLOCK  0.1  [get_ports {c_out[0]}]
